Public Member Functions | Friends | List of all members
IFCAPI::v1::PropertyBoundedValue Class Referencefinal
IFC Data Access
Represents an IfcPropertyBoundedValue. More...
#include <IFCProperty.hpp>
 Inheritance diagram for IFCAPI::v1::PropertyBoundedValue:
 Public Member Functions
IFCAPI::Value  | GetUpperBoundValue () const
Get the upper bound of the property bounded value.
IFCAPI::Value  | GetLowerBoundValue () const
Get the lower bound of the property bounded value.
IFCAPI::Value  | GetSetPointValue () const
Get the set point of the property bounded value.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Property
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IfcPropertyBoundedValue.
Since
Archicad 28